tutorial/blade/fluid/0.orig/pointDisplacement
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    blade
    {
        type            fixedValue;
        value           $internalField;
    }
    
    "externalDomain_.*"
    {
        type            symmetryPlane;
    }

    floor
    {
        type            symmetryPlane;
    }
}
