tutorial/blade/fluid/system/fwhControl
Farassat1A-Patch
{
        type            FfowcsWilliamsHawkings;
        formulationType Farassat1AFormulation;
        #include        "commonSettings";
        patches (blade);
        interpolationScheme cell;

        surfaces
        (
                blade
                {
                    type            patch;
                    patches         (blade);
                    interpolate     false;
                }
        );
        fixedResponseDelay      false;
        responseDelay           0.1;
        nonUniformSurfaceMotion false;
        Ufwh                    (.0 .0 .0);
        U0                      (.0 .0 .0);
}
